SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32MG22/Include/efr32mg22_modem.h
  __IOM uint32_t            DIGIGAINCTRL_SET;    /**< Digital Gain Control                               */
  __IOM uint32_t            PRSCTRL_SET;         /**< Mux control for PRS outputs                        */
  uint32_t                  RESERVED24[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            REALTIMCFE_SET;      /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t            SEQIF_SET;           /**< SEQ Interrupt Flags                                */
  __IOM uint32_t            SEQIEN_SET;          /**< SEQ Interrupt Enable                               */
  __IOM uint32_t            ETSCTRL_SET;         /**< Early Time Stamp Control                           */
  __IOM uint32_t            ANTSWCTRL_SET;       /**< Antenna Switch Control                             */
  __IOM uint32_t            ANTSWSTART_SET;      /**< Antenna Switch Start                               */
  __IOM uint32_t            ANTSWEND_SET;        /**< Antenna Switch End                                 */
  __IOM uint32_t            TRECPMPATT_SET;      /**< Trecs Preamble pattern                             */
  __IOM uint32_t            TRECPMDET_SET;       /**< Trecs preamble Detection CTRL                      */
  __IOM uint32_t            CFGANTPATT_SET;      /**< Configure Antenna Pattern                          */
  __IOM uint32_t            ETSTIM_SET;          /**< Early Time Stamp Timing                            */
  __IOM uint32_t            ANTSWCTRL1_SET;      /**< Antenna Switch Control 1                           */
  __IOM uint32_t            COCURRMODE_SET;      /**< CONCURRENT MODE                                    */
  __IOM uint32_t            ANTDIVCTRL_SET;      /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t            BLEIQDSAEXT2_SET;    /**< BLEIQDSA Extention2                                */
  __IOM uint32_t            SPARE_SET;           /**< Spare register                                     */
  MODEM_IRCALCOEFWR_TypeDef IRCALCOEFWR_SET[2U]; /**< IRCAL COEFS WR per antenna                         */
  uint32_t                  RESERVED25[860U];    /**< Reserved for future use                            */
  __IM uint32_t             IPVERSION_CLR;       /**< IP Version                                         */
  __IOM uint32_t            EN_CLR;              /**< Enable peripheral clock to this module             */
  __IM uint32_t             STATUS_CLR;          /**< Status Register                                    */
  __IM uint32_t             TIMDETSTATUS_CLR;    /**< Timing Detection Status Register                   */
  __IM uint32_t             FREQOFFEST_CLR;      /**< Frequency Offset Estimate                          */
  __IM uint32_t             AFCADJRX_CLR;        /**< AFC Adjustment RX                                  */
  __IM uint32_t             AFCADJTX_CLR;        /**< AFC Adjustment TX                                  */
  __IOM uint32_t            MIXCTRL_CLR;         /**< Analog mixer control                               */
  __IOM uint32_t            CTRL0_CLR;           /**< Control Register 0                                 */
  __IOM uint32_t            CTRL1_CLR;           /**< Control Register 1                                 */
  __IOM uint32_t            CTRL2_CLR;           /**< Control Register 2                                 */
  __IOM uint32_t            CTRL3_CLR;           /**< Control Register 3                                 */
  __IOM uint32_t            CTRL4_CLR;           /**< Control Register 4                                 */
  __IOM uint32_t            CTRL5_CLR;           /**< Control Register 5                                 */
  __IOM uint32_t            CTRL6_CLR;           /**< Control Register 6                                 */
  uint32_t                  RESERVED26[7U];      /**< Reserved for future use                            */
  __IOM uint32_t            TXBR_CLR;            /**< Transmit baudrate                                  */
  __IOM uint32_t            RXBR_CLR;            /**< Receive Baudrate                                   */
  __IOM uint32_t            CF_CLR;              /**< Channel Filter                                     */
  __IOM uint32_t            PRE_CLR;             /**< Preamble Register                                  */
  __IOM uint32_t            SYNC0_CLR;           /**< Sync word 0                                        */
  __IOM uint32_t            SYNC1_CLR;           /**< Sync word 1                                        */
  uint32_t                  RESERVED27[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            TIMING_CLR;          /**< Timing Register                                    */
  __IOM uint32_t            DSSS0_CLR;           /**< DSSS symbol 0 Register                             */
  __IOM uint32_t            MODINDEX_CLR;        /**< Modulation Index                                   */
  __IOM uint32_t            AFC_CLR;             /**< Automatic Frequency Control                        */
  __IOM uint32_t            AFCADJLIM_CLR;       /**< AFC Adjustment Limit                               */
  __IOM uint32_t            SHAPING0_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING1_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING2_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING3_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING4_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING5_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING6_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING7_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING8_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING9_CLR;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING10_CLR;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING11_CLR;       /**< Shaping Coefficients                               */
  __IOM uint32_t            RAMPCTRL_CLR;        /**< Ramping Register                                   */
  uint32_t                  RESERVED28[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            RAMPLEV_CLR;         /**< Ramping Register                                   */
  uint32_t                  RESERVED29[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            DCCOMP_CLR;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t            DCCOMPFILTINIT_CLR;  /**< DC Offset compensation Filter                      */
  __IM uint32_t             DCESTI_CLR;          /**< DC Offset Estimated value                          */
  __IOM uint32_t            SRCCHF_CLR;          /**< SRC ratio values and channel filter                */
  uint32_t                  RESERVED30[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD0_CLR;         /**< DSA detector threshold-0                           */
  __IOM uint32_t            DSATHD1_CLR;         /**< DSA detector threshold-1                           */
  __IOM uint32_t            DSACTRL_CLR;         /**< DSA mode                                           */
  __IOM uint32_t            VITERBIDEMOD_CLR;    /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG0_CLR;      /**< Viterbi demodulator                                */
  uint32_t                  RESERVED31[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DIGMIXCTRL_CLR;      /**< Digital mixer control register                     */
  __IOM uint32_t            VTCORRCFG1_CLR;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTTRACK_CLR;         /**< Viterbi demodulator tracking loop                  */
  __IM uint32_t             BREST_CLR;           /**< Baudrate Estimate                                  */
  uint32_t                  RESERVED32[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            AUTOCG_CLR;          /**< Automatic clock gating                             */
  __IOM uint32_t            CGCLKSTOP_CLR;       /**< Automatic clock gating                             */
  uint32_t                  RESERVED33[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD2_CLR;         /**< DSA detector threshold-2                           */
  __IOM uint32_t            DIRECTMODE_CLR;      /**< Direct Mode Control                                */
  __IOM uint32_t            LONGRANGE_CLR;       /**< BLE Long Range                                     */
  __IOM uint32_t            LONGRANGE1_CLR;      /**< BLE Long Range Set1                                */
  __IOM uint32_t            LONGRANGE2_CLR;      /**< BLE Long Range Set2                                */
  __IOM uint32_t            LONGRANGE3_CLR;      /**< BLE Long Range Set3                                */
  __IOM uint32_t            LONGRANGE4_CLR;      /**< BLE Long Range Set4                                */
  __IOM uint32_t            LONGRANGE5_CLR;      /**< BLE Long Range Set5                                */
  __IOM uint32_t            LONGRANGE6_CLR;      /**< BLE Long Range Set6                                */
  __IOM uint32_t            LRFRC_CLR;           /**< BLE Long Range FRC interface                       */
  uint32_t                  RESERVED34[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD3_CLR;         /**< DSA detector threshold 3                           */
  __IOM uint32_t            DSATHD4_CLR;         /**< DSA detector threshold 4                           */
  __IOM uint32_t            VTBLETIMING_CLR;     /**< Viterbi BLE timing stamp control                   */
  uint32_t                  RESERVED35[37U];     /**< Reserved for future use                            */
  __IOM uint32_t            IF_CLR;              /**< Interrupt Flags                                    */
  __IOM uint32_t            IEN_CLR;             /**< Interrupt Enable                                   */
  uint32_t                  RESERVED36[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            CMD_CLR;             /**< Command register                                   */
  __IM uint32_t             FSMSTATUS_CLR;       /**< Demod FSM Status Register                          */
  __IM uint32_t             STATUS2_CLR;         /**< Status Register 2                                  */
  __IM uint32_t             STATUS3_CLR;         /**< Status Register 3                                  */
  __IOM uint32_t            IRCAL_CLR;           /**< IRCAL control signals                              */
  __IM uint32_t             IRCALCOEF_CLR;       /**< IRCAL COEF values                                  */
  __IOM uint32_t            BLEIQDSA_CLR;        /**< BLEIQDSA                                           */
  __IOM uint32_t            BLEIQDSAEXT1_CLR;    /**< BLEIQDSA Extention1                                */
  __IOM uint32_t            SYNCPROPERTIES_CLR;  /**< Sync word properties                               */
  __IOM uint32_t            DIGIGAINCTRL_CLR;    /**< Digital Gain Control                               */
  __IOM uint32_t            PRSCTRL_CLR;         /**< Mux control for PRS outputs                        */
  uint32_t                  RESERVED37[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            REALTIMCFE_CLR;      /**< Real time Cost Function Engine CTRL                */
  __IOM uint32_t            SEQIF_CLR;           /**< SEQ Interrupt Flags                                */
  __IOM uint32_t            SEQIEN_CLR;          /**< SEQ Interrupt Enable                               */
  __IOM uint32_t            ETSCTRL_CLR;         /**< Early Time Stamp Control                           */
  __IOM uint32_t            ANTSWCTRL_CLR;       /**< Antenna Switch Control                             */
  __IOM uint32_t            ANTSWSTART_CLR;      /**< Antenna Switch Start                               */
  __IOM uint32_t            ANTSWEND_CLR;        /**< Antenna Switch End                                 */
  __IOM uint32_t            TRECPMPATT_CLR;      /**< Trecs Preamble pattern                             */
  __IOM uint32_t            TRECPMDET_CLR;       /**< Trecs preamble Detection CTRL                      */
  __IOM uint32_t            CFGANTPATT_CLR;      /**< Configure Antenna Pattern                          */
  __IOM uint32_t            ETSTIM_CLR;          /**< Early Time Stamp Timing                            */
  __IOM uint32_t            ANTSWCTRL1_CLR;      /**< Antenna Switch Control 1                           */
  __IOM uint32_t            COCURRMODE_CLR;      /**< CONCURRENT MODE                                    */
  __IOM uint32_t            ANTDIVCTRL_CLR;      /**< Antenna Diversity Mode Control Register            */
  __IOM uint32_t            BLEIQDSAEXT2_CLR;    /**< BLEIQDSA Extention2                                */
  __IOM uint32_t            SPARE_CLR;           /**< Spare register                                     */
  MODEM_IRCALCOEFWR_TypeDef IRCALCOEFWR_CLR[2U]; /**< IRCAL COEFS WR per antenna                         */
  uint32_t                  RESERVED38[860U];    /**< Reserved for future use                            */
  __IM uint32_t             IPVERSION_TGL;       /**< IP Version                                         */
  __IOM uint32_t            EN_TGL;              /**< Enable peripheral clock to this module             */
  __IM uint32_t             STATUS_TGL;          /**< Status Register                                    */
  __IM uint32_t             TIMDETSTATUS_TGL;    /**< Timing Detection Status Register                   */
  __IM uint32_t             FREQOFFEST_TGL;      /**< Frequency Offset Estimate                          */
  __IM uint32_t             AFCADJRX_TGL;        /**< AFC Adjustment RX                                  */
  __IM uint32_t             AFCADJTX_TGL;        /**< AFC Adjustment TX                                  */
  __IOM uint32_t            MIXCTRL_TGL;         /**< Analog mixer control                               */
  __IOM uint32_t            CTRL0_TGL;           /**< Control Register 0                                 */
  __IOM uint32_t            CTRL1_TGL;           /**< Control Register 1                                 */
  __IOM uint32_t            CTRL2_TGL;           /**< Control Register 2                                 */
  __IOM uint32_t            CTRL3_TGL;           /**< Control Register 3                                 */
  __IOM uint32_t            CTRL4_TGL;           /**< Control Register 4                                 */
  __IOM uint32_t            CTRL5_TGL;           /**< Control Register 5                                 */
  __IOM uint32_t            CTRL6_TGL;           /**< Control Register 6                                 */
  uint32_t                  RESERVED39[7U];      /**< Reserved for future use                            */
  __IOM uint32_t            TXBR_TGL;            /**< Transmit baudrate                                  */
  __IOM uint32_t            RXBR_TGL;            /**< Receive Baudrate                                   */
  __IOM uint32_t            CF_TGL;              /**< Channel Filter                                     */
  __IOM uint32_t            PRE_TGL;             /**< Preamble Register                                  */
  __IOM uint32_t            SYNC0_TGL;           /**< Sync word 0                                        */
  __IOM uint32_t            SYNC1_TGL;           /**< Sync word 1                                        */
  uint32_t                  RESERVED40[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            TIMING_TGL;          /**< Timing Register                                    */
  __IOM uint32_t            DSSS0_TGL;           /**< DSSS symbol 0 Register                             */
  __IOM uint32_t            MODINDEX_TGL;        /**< Modulation Index                                   */
  __IOM uint32_t            AFC_TGL;             /**< Automatic Frequency Control                        */
  __IOM uint32_t            AFCADJLIM_TGL;       /**< AFC Adjustment Limit                               */
  __IOM uint32_t            SHAPING0_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING1_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING2_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING3_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING4_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING5_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING6_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING7_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING8_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING9_TGL;        /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING10_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            SHAPING11_TGL;       /**< Shaping Coefficients                               */
  __IOM uint32_t            RAMPCTRL_TGL;        /**< Ramping Register                                   */
  uint32_t                  RESERVED41[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            RAMPLEV_TGL;         /**< Ramping Register                                   */
  uint32_t                  RESERVED42[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            DCCOMP_TGL;          /**< DC Offset Compensation Filter Settings             */
  __IOM uint32_t            DCCOMPFILTINIT_TGL;  /**< DC Offset compensation Filter                      */
  __IM uint32_t             DCESTI_TGL;          /**< DC Offset Estimated value                          */
  __IOM uint32_t            SRCCHF_TGL;          /**< SRC ratio values and channel filter                */
  uint32_t                  RESERVED43[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD0_TGL;         /**< DSA detector threshold-0                           */
  __IOM uint32_t            DSATHD1_TGL;         /**< DSA detector threshold-1                           */
  __IOM uint32_t            DSACTRL_TGL;         /**< DSA mode                                           */
  __IOM uint32_t            VITERBIDEMOD_TGL;    /**< Viterbi demodulator                                */
  __IOM uint32_t            VTCORRCFG0_TGL;      /**< Viterbi demodulator                                */
  uint32_t                  RESERVED44[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DIGMIXCTRL_TGL;      /**< Digital mixer control register                     */
  __IOM uint32_t            VTCORRCFG1_TGL;      /**< Viterbi demodulator                                */
  __IOM uint32_t            VTTRACK_TGL;         /**< Viterbi demodulator tracking loop                  */
  __IM uint32_t             BREST_TGL;           /**< Baudrate Estimate                                  */
  uint32_t                  RESERVED45[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            AUTOCG_TGL;          /**< Automatic clock gating                             */
  __IOM uint32_t            CGCLKSTOP_TGL;       /**< Automatic clock gating                             */
  uint32_t                  RESERVED46[1U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD2_TGL;         /**< DSA detector threshold-2                           */
  __IOM uint32_t            DIRECTMODE_TGL;      /**< Direct Mode Control                                */
  __IOM uint32_t            LONGRANGE_TGL;       /**< BLE Long Range                                     */
  __IOM uint32_t            LONGRANGE1_TGL;      /**< BLE Long Range Set1                                */
  __IOM uint32_t            LONGRANGE2_TGL;      /**< BLE Long Range Set2                                */
  __IOM uint32_t            LONGRANGE3_TGL;      /**< BLE Long Range Set3                                */
  __IOM uint32_t            LONGRANGE4_TGL;      /**< BLE Long Range Set4                                */
  __IOM uint32_t            LONGRANGE5_TGL;      /**< BLE Long Range Set5                                */
  __IOM uint32_t            LONGRANGE6_TGL;      /**< BLE Long Range Set6                                */
  __IOM uint32_t            LRFRC_TGL;           /**< BLE Long Range FRC interface                       */
  uint32_t                  RESERVED47[4U];      /**< Reserved for future use                            */
  __IOM uint32_t            DSATHD3_TGL;         /**< DSA detector threshold 3                           */
  __IOM uint32_t            DSATHD4_TGL;         /**< DSA detector threshold 4                           */
  __IOM uint32_t            VTBLETIMING_TGL;     /**< Viterbi BLE timing stamp control                   */
  uint32_t                  RESERVED48[37U];     /**< Reserved for future use                            */
  __IOM uint32_t            IF_TGL;              /**< Interrupt Flags                                    */
  __IOM uint32_t            IEN_TGL;             /**< Interrupt Enable                                   */
  uint32_t                  RESERVED49[2U];      /**< Reserved for future use                            */
  __IOM uint32_t            CMD_TGL;             /**< Command register                                   */
  __IM uint32_t             FSMSTATUS_TGL;       /**< Demod FSM Status Register                          */
  __IM uint32_t             STATUS2_TGL;         /**< Status Register 2                                  */
  __IM uint32_t             STATUS3_TGL;         /**< Status Register 3                                  */
  __IOM uint32_t            IRCAL_TGL;           /**< IRCAL control signals                              */
  __IM uint32_t             IRCALCOEF_TGL;       /**< IRCAL COEF values                                  */
  __IOM uint32_t            BLEIQDSA_TGL;        /**< BLEIQDSA                                           */
  __IOM uint32_t            BLEIQDSAEXT1_TGL;    /**< BLEIQDSA Extention1                                */
  __IOM uint32_t            SYNCPROPERTIES_TGL;  /**< Sync word properties                               */
